TexasInstruments/mspm0-sdk/source/third_party/tinyusb/hw/mcu/ti/mspm0/ti/devices/msp/peripherals/hw_btimer.h
/*****************************************************************************

  Copyright (C) 2024 Texas Instruments Incorporated - http://www.ti.com/ 

  Redistribution and use in source and binary forms, with or without 
  modification, are permitted provided that the following conditions 
  are met:

   Redistributions of source code must retain the above copyright 
   notice, this list of conditions and the following disclaimer.

   Redistributions in binary form must reproduce the above copyright
   notice, this list of conditions and the following disclaimer in the 
   documentation and/or other materials provided with the   
   distribution.

   Neither the name of Texas Instruments Incorporated nor the names of
   its contributors may be used to endorse or promote products derived
   from this software without specific prior written permission.

  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

*****************************************************************************/

#ifndef ti_devices_msp_peripherals_hw_btimer__include
#define ti_devices_msp_peripherals_hw_btimer__include

/* Filename: hw_btimer.h */
/* Revised: 2024-06-05 04:16:28 */
/* Revision: 952104399038670370f108bbde01f8fcea266891 */

#ifndef __CORTEX_M
  #ifdef __cplusplus
    #define __I  volatile        /*!< Defines 'read only' permissions */
  #else
    #define __I  volatile const  /*!< Defines 'read only' permissions */
  #endif
  #define __O  volatile          /*!< Defines 'write only' permissions */
  #define __IO  volatile         /*!< Defines 'read / write' permissions */

  /* following defines should be used for structure members */
  #define __IM  volatile const   /*! Defines 'read only' structure member permissions */
  #define __OM  volatile         /*! Defines 'write only' structure member permissions */
  #define __IOM  volatile        /*! Defines 'read / write' structure member permissions */
#endif

/* Use standard integer types with explicit width */
#include <stdint.h>

#ifdef __cplusplus
 extern "C" {
#endif

#if defined ( __CC_ARM )
#pragma anon_unions
#endif

/******************************************************************************
* BTIMER Registers
******************************************************************************/
#define BTIMER_CTRREGS_OFS                       ((uint32_t)0x00001100U)
#define BTIMER_GEN_EVENT_OFS                     ((uint32_t)0x00001050U)
#define BTIMER_CPU_INT_OFS                       ((uint32_t)0x00001020U)
#define BTIMER_GPRCM_OFS                         ((uint32_t)0x00000800U)


/** @addtogroup BTIMER_CTRREGS
  @{
*/

typedef struct {
  __IO uint32_t CTL0;                              /* !< (@ 0x00001100) CTL0 register */
  __IO uint32_t LD;                                /* !< (@ 0x00001104) Counter period register. */
  __IO uint32_t CNT;                               /* !< (@ 0x00001108) Counter register. */
       uint32_t RESERVED0[61];
} BTIMER_CTRREGS_Regs;

/*@}*/ /* end of group BTIMER_CTRREGS */

/** @addtogroup BTIMER_GEN_EVENT
  @{
*/

typedef struct {
  __I  uint32_t IIDX;                              /* !< (@ 0x00001050) Interrupt index */
       uint32_t RESERVED0;
  __IO uint32_t IMASK;                             /* !< (@ 0x00001058) Interrupt Mask. If a bit is set, then
                                                      corresponding interrupt is un-masked. Un-masking the interrupt
                                                      causes the raw interrupt to be visible in IIDX, as well as MIS. */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x00001060) Raw interrupt status. Reflects all pending
                                                      interrupts, regardless of masking. The RIS register allows the user
                                                      to implement a poll scheme. A flag set in this register can be
                                                      cleared by writing 1 to the ICLR register bit even if the
                                                      corresponding IMASK bit is not enabled. */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x00001068) Masked interrupt status. This is an AND of the
                                                      IMASK and RIS registers. */
       uint32_t RESERVED3;
  __O  uint32_t ISET;                              /* !< (@ 0x00001070) Interrupt set. Allows interrupts to be set by
                                                      software (useful in diagnostics and safety checks). Writing a 1 to
                                                      a bit in ISET will set the event and therefore the related RIS bit
                                                      also gets set. If the interrupt is enabled through the mask, then
                                                      the corresponding MIS bit is also set. */
       uint32_t RESERVED4;
  __O  uint32_t ICLR;                              /* !< (@ 0x00001078) Interrupt clear. Write a 1 to clear corresponding
                                                      Interrupt. */
} BTIMER_GEN_EVENT_Regs;

/*@}*/ /* end of group BTIMER_GEN_EVENT */

/** @addtogroup BTIMER_CPU_INT
  @{
*/

