TexasInstruments/mspm0-sdk/source/third_party/tinyusb/hw/mcu/ti/mspm0/ti/devices/msp/peripherals/hw_btimer.h
/* BTIMER_CPU_INT_IMASK Bits */
/* BTIMER_CPU_INT_IMASK[CNT0OVF] Bits */
#define BTIMER_CPU_INT_IMASK_CNT0OVF_OFS         (0)                             /* !< CNT0OVF Offset */
#define BTIMER_CPU_INT_IMASK_CNT0OVF_MASK        ((uint32_t)0x00000001U)         /* !< CNT0OVF Interrupt enable bit */
#define BTIMER_CPU_INT_IMASK_CNT0OVF_CLR         ((uint32_t)0x00000000U)         /* !< Interrupt is not pending. */
#define BTIMER_CPU_INT_IMASK_CNT0OVF_SET         ((uint32_t)0x00000001U)         /* !< Interrupt is pending. */
/* BTIMER_CPU_INT_IMASK[CNT0STRT] Bits */
#define BTIMER_CPU_INT_IMASK_CNT0STRT_OFS        (1)                             /* !< CNT0STRT Offset */
#define BTIMER_CPU_INT_IMASK_CNT0STRT_MASK       ((uint32_t)0x00000002U)         /* !< CNT0STRT Interrupt enable bit */
#define BTIMER_CPU_INT_IMASK_CNT0STRT_CLR        ((uint32_t)0x00000000U)         /* !< Interrupt is not pending. */
#define BTIMER_CPU_INT_IMASK_CNT0STRT_SET        ((uint32_t)0x00000002U)         /* !< Interrupt is pending. */
/* BTIMER_CPU_INT_IMASK[CNT0STOP] Bits */
#define BTIMER_CPU_INT_IMASK_CNT0STOP_OFS        (2)                             /* !< CNT0STOP Offset */
#define BTIMER_CPU_INT_IMASK_CNT0STOP_MASK       ((uint32_t)0x00000004U)         /* !< CNT0STOP Interrupt enable bit */
#define BTIMER_CPU_INT_IMASK_CNT0STOP_CLR        ((uint32_t)0x00000000U)         /* !< Interrupt is not pending. */
#define BTIMER_CPU_INT_IMASK_CNT0STOP_SET        ((uint32_t)0x00000004U)         /* !< Interrupt is pending. */
/* BTIMER_CPU_INT_IMASK[CNT1OVF] Bits */
#define BTIMER_CPU_INT_IMASK_CNT1OVF_OFS         (3)                             /* !< CNT1OVF Offset */
#define BTIMER_CPU_INT_IMASK_CNT1OVF_MASK        ((uint32_t)0x00000008U)         /* !< CNT1OVF Interrupt enable bit */
#define BTIMER_CPU_INT_IMASK_CNT1OVF_CLR         ((uint32_t)0x00000000U)         /* !< Interrupt is not pending. */
#define BTIMER_CPU_INT_IMASK_CNT1OVF_SET         ((uint32_t)0x00000008U)         /* !< Interrupt is pending. */
/* BTIMER_CPU_INT_IMASK[CNT1STRT] Bits */
#define BTIMER_CPU_INT_IMASK_CNT1STRT_OFS        (4)                             /* !< CNT1STRT Offset */
#define BTIMER_CPU_INT_IMASK_CNT1STRT_MASK       ((uint32_t)0x00000010U)         /* !< CNT1STRT Interrupt enable bit */
#define BTIMER_CPU_INT_IMASK_CNT1STRT_CLR        ((uint32_t)0x00000000U)         /* !< Interrupt is not pending. */
#define BTIMER_CPU_INT_IMASK_CNT1STRT_SET        ((uint32_t)0x00000010U)         /* !< Interrupt is pending. */
/* BTIMER_CPU_INT_IMASK[CNT1STOP] Bits */
#define BTIMER_CPU_INT_IMASK_CNT1STOP_OFS        (5)                             /* !< CNT1STOP Offset */
#define BTIMER_CPU_INT_IMASK_CNT1STOP_MASK       ((uint32_t)0x00000020U)         /* !< CNT1STOP Interrupt enable bit */
#define BTIMER_CPU_INT_IMASK_CNT1STOP_CLR        ((uint32_t)0x00000000U)         /* !< Interrupt is not pending. */
#define BTIMER_CPU_INT_IMASK_CNT1STOP_SET        ((uint32_t)0x00000020U)         /* !< Interrupt is pending. */
/* BTIMER_CPU_INT_IMASK[CNT2OVF] Bits */
#define BTIMER_CPU_INT_IMASK_CNT2OVF_OFS         (6)                             /* !< CNT2OVF Offset */
#define BTIMER_CPU_INT_IMASK_CNT2OVF_MASK        ((uint32_t)0x00000040U)         /* !< CNT2OVF Interrupt enable bit */
#define BTIMER_CPU_INT_IMASK_CNT2OVF_CLR         ((uint32_t)0x00000000U)         /* !< Interrupt is not pending. */
#define BTIMER_CPU_INT_IMASK_CNT2OVF_SET         ((uint32_t)0x00000040U)         /* !< Interrupt is pending. */
/* BTIMER_CPU_INT_IMASK[CNT2STRT] Bits */
#define BTIMER_CPU_INT_IMASK_CNT2STRT_OFS        (7)                             /* !< CNT2STRT Offset */
#define BTIMER_CPU_INT_IMASK_CNT2STRT_MASK       ((uint32_t)0x00000080U)         /* !< CNT2STRT Interrupt enable bit */
#define BTIMER_CPU_INT_IMASK_CNT2STRT_CLR        ((uint32_t)0x00000000U)         /* !< Interrupt is not pending. */
#define BTIMER_CPU_INT_IMASK_CNT2STRT_SET        ((uint32_t)0x00000080U)         /* !< Interrupt is pending. */
/* BTIMER_CPU_INT_IMASK[CNT2STOP] Bits */
#define BTIMER_CPU_INT_IMASK_CNT2STOP_OFS        (8)                             /* !< CNT2STOP Offset */
#define BTIMER_CPU_INT_IMASK_CNT2STOP_MASK       ((uint32_t)0x00000100U)         /* !< CNT2STOP Interrupt enable bit */
#define BTIMER_CPU_INT_IMASK_CNT2STOP_CLR        ((uint32_t)0x00000000U)         /* !< Interrupt is not pending. */
#define BTIMER_CPU_INT_IMASK_CNT2STOP_SET        ((uint32_t)0x00000100U)         /* !< Interrupt is pending. */
/* BTIMER_CPU_INT_IMASK[CNT3OVF] Bits */
#define BTIMER_CPU_INT_IMASK_CNT3OVF_OFS         (9)                             /* !< CNT3OVF Offset */
#define BTIMER_CPU_INT_IMASK_CNT3OVF_MASK        ((uint32_t)0x00000200U)         /* !< CNT3OVF Interrupt enable bit */
#define BTIMER_CPU_INT_IMASK_CNT3OVF_CLR         ((uint32_t)0x00000000U)         /* !< Interrupt is not pending. */
#define BTIMER_CPU_INT_IMASK_CNT3OVF_SET         ((uint32_t)0x00000200U)         /* !< Interrupt is pending. */
/* BTIMER_CPU_INT_IMASK[CNT3STRT] Bits */
#define BTIMER_CPU_INT_IMASK_CNT3STRT_OFS        (10)                            /* !< CNT3STRT Offset */
#define BTIMER_CPU_INT_IMASK_CNT3STRT_MASK       ((uint32_t)0x00000400U)         /* !< CNT3STRT Interrupt enable bit */
#define BTIMER_CPU_INT_IMASK_CNT3STRT_CLR        ((uint32_t)0x00000000U)         /* !< Interrupt is not pending. */
#define BTIMER_CPU_INT_IMASK_CNT3STRT_SET        ((uint32_t)0x00000400U)         /* !< Interrupt is pending. */
/* BTIMER_CPU_INT_IMASK[CNT3STOP] Bits */
#define BTIMER_CPU_INT_IMASK_CNT3STOP_OFS        (11)                            /* !< CNT3STOP Offset */
#define BTIMER_CPU_INT_IMASK_CNT3STOP_MASK       ((uint32_t)0x00000800U)         /* !< CNT3STOP Interrupt enable bit */
#define BTIMER_CPU_INT_IMASK_CNT3STOP_CLR        ((uint32_t)0x00000000U)         /* !< Interrupt is not pending. */
#define BTIMER_CPU_INT_IMASK_CNT3STOP_SET        ((uint32_t)0x00000800U)         /* !< Interrupt is pending. */
/* BTIMER_CPU_INT_IMASK[CNT4OVF] Bits */
#define BTIMER_CPU_INT_IMASK_CNT4OVF_OFS         (12)                            /* !< CNT4OVF Offset */
#define BTIMER_CPU_INT_IMASK_CNT4OVF_MASK        ((uint32_t)0x00001000U)         /* !< CNT4OVF Interrupt enable bit */
#define BTIMER_CPU_INT_IMASK_CNT4OVF_CLR         ((uint32_t)0x00000000U)         /* !< Interrupt is not pending. */
#define BTIMER_CPU_INT_IMASK_CNT4OVF_SET         ((uint32_t)0x00001000U)         /* !< Interrupt is pending. */
/* BTIMER_CPU_INT_IMASK[CNT4STRT] Bits */
#define BTIMER_CPU_INT_IMASK_CNT4STRT_OFS        (13)                            /* !< CNT4STRT Offset */
#define BTIMER_CPU_INT_IMASK_CNT4STRT_MASK       ((uint32_t)0x00002000U)         /* !< CNT4STRT Interrupt enable bit */
#define BTIMER_CPU_INT_IMASK_CNT4STRT_CLR        ((uint32_t)0x00000000U)         /* !< Interrupt is not pending. */
#define BTIMER_CPU_INT_IMASK_CNT4STRT_SET        ((uint32_t)0x00002000U)         /* !< Interrupt is pending. */
/* BTIMER_CPU_INT_IMASK[CNT4STOP] Bits */
#define BTIMER_CPU_INT_IMASK_CNT4STOP_OFS        (14)                            /* !< CNT4STOP Offset */
#define BTIMER_CPU_INT_IMASK_CNT4STOP_MASK       ((uint32_t)0x00004000U)         /* !< CNT4STOP Interrupt enable bit */
#define BTIMER_CPU_INT_IMASK_CNT4STOP_CLR        ((uint32_t)0x00000000U)         /* !< Interrupt is not pending. */
#define BTIMER_CPU_INT_IMASK_CNT4STOP_SET        ((uint32_t)0x00004000U)         /* !< Interrupt is pending. */
/* BTIMER_CPU_INT_IMASK[CNT5OVF] Bits */
#define BTIMER_CPU_INT_IMASK_CNT5OVF_OFS         (15)                            /* !< CNT5OVF Offset */
#define BTIMER_CPU_INT_IMASK_CNT5OVF_MASK        ((uint32_t)0x00008000U)         /* !< CNT5OVF Interrupt enable bit */
#define BTIMER_CPU_INT_IMASK_CNT5OVF_CLR         ((uint32_t)0x00000000U)         /* !< Interrupt is not pending. */
#define BTIMER_CPU_INT_IMASK_CNT5OVF_SET         ((uint32_t)0x00008000U)         /* !< Interrupt is pending. */
/* BTIMER_CPU_INT_IMASK[CNT5STRT] Bits */
#define BTIMER_CPU_INT_IMASK_CNT5STRT_OFS        (16)                            /* !< CNT5STRT Offset */
#define BTIMER_CPU_INT_IMASK_CNT5STRT_MASK       ((uint32_t)0x00010000U)         /* !< CNT5STRT Interrupt enable bit */
#define BTIMER_CPU_INT_IMASK_CNT5STRT_CLR        ((uint32_t)0x00000000U)         /* !< Interrupt is not pending. */
#define BTIMER_CPU_INT_IMASK_CNT5STRT_SET        ((uint32_t)0x00010000U)         /* !< Interrupt is pending. */
/* BTIMER_CPU_INT_IMASK[CNT5STOP] Bits */
#define BTIMER_CPU_INT_IMASK_CNT5STOP_OFS        (17)                            /* !< CNT5STOP Offset */
#define BTIMER_CPU_INT_IMASK_CNT5STOP_MASK       ((uint32_t)0x00020000U)         /* !< CNT5STOP Interrupt enable bit */
#define BTIMER_CPU_INT_IMASK_CNT5STOP_CLR        ((uint32_t)0x00000000U)         /* !< Interrupt is not pending. */
#define BTIMER_CPU_INT_IMASK_CNT5STOP_SET        ((uint32_t)0x00020000U)         /* !< Interrupt is pending. */
/* BTIMER_CPU_INT_IMASK[CNT6OVF] Bits */
#define BTIMER_CPU_INT_IMASK_CNT6OVF_OFS         (18)                            /* !< CNT6OVF Offset */
#define BTIMER_CPU_INT_IMASK_CNT6OVF_MASK        ((uint32_t)0x00040000U)         /* !< CNT6OVF Interrupt enable bit */
#define BTIMER_CPU_INT_IMASK_CNT6OVF_CLR         ((uint32_t)0x00000000U)         /* !< Interrupt is not pending. */
#define BTIMER_CPU_INT_IMASK_CNT6OVF_SET         ((uint32_t)0x00040000U)         /* !< Interrupt is pending. */
/* BTIMER_CPU_INT_IMASK[CNT6STRT] Bits */
#define BTIMER_CPU_INT_IMASK_CNT6STRT_OFS        (19)                            /* !< CNT6STRT Offset */
#define BTIMER_CPU_INT_IMASK_CNT6STRT_MASK       ((uint32_t)0x00080000U)         /* !< CNT6STRT Interrupt enable bit */
#define BTIMER_CPU_INT_IMASK_CNT6STRT_CLR        ((uint32_t)0x00000000U)         /* !< Interrupt is not pending. */
#define BTIMER_CPU_INT_IMASK_CNT6STRT_SET        ((uint32_t)0x00080000U)         /* !< Interrupt is pending. */
/* BTIMER_CPU_INT_IMASK[CNT6STOP] Bits */
#define BTIMER_CPU_INT_IMASK_CNT6STOP_OFS        (20)                            /* !< CNT6STOP Offset */
#define BTIMER_CPU_INT_IMASK_CNT6STOP_MASK       ((uint32_t)0x00100000U)         /* !< CNT6STOP Interrupt enable bit */
#define BTIMER_CPU_INT_IMASK_CNT6STOP_CLR        ((uint32_t)0x00000000U)         /* !< Interrupt is not pending. */
#define BTIMER_CPU_INT_IMASK_CNT6STOP_SET        ((uint32_t)0x00100000U)         /* !< Interrupt is pending. */
/* BTIMER_CPU_INT_IMASK[CNT7OVF] Bits */
#define BTIMER_CPU_INT_IMASK_CNT7OVF_OFS         (21)                            /* !< CNT7OVF Offset */
#define BTIMER_CPU_INT_IMASK_CNT7OVF_MASK        ((uint32_t)0x00200000U)         /* !< CNT7OVF Interrupt enable bit */
#define BTIMER_CPU_INT_IMASK_CNT7OVF_CLR         ((uint32_t)0x00000000U)         /* !< Interrupt is not pending. */
#define BTIMER_CPU_INT_IMASK_CNT7OVF_SET         ((uint32_t)0x00200000U)         /* !< Interrupt is pending. */
/* BTIMER_CPU_INT_IMASK[CNT7STRT] Bits */
#define BTIMER_CPU_INT_IMASK_CNT7STRT_OFS        (22)                            /* !< CNT7STRT Offset */
#define BTIMER_CPU_INT_IMASK_CNT7STRT_MASK       ((uint32_t)0x00400000U)         /* !< CNT7STRT Interrupt enable bit */
#define BTIMER_CPU_INT_IMASK_CNT7STRT_CLR        ((uint32_t)0x00000000U)         /* !< Interrupt is not pending. */
#define BTIMER_CPU_INT_IMASK_CNT7STRT_SET        ((uint32_t)0x00400000U)         /* !< Interrupt is pending. */
/* BTIMER_CPU_INT_IMASK[CNT7STOP] Bits */
#define BTIMER_CPU_INT_IMASK_CNT7STOP_OFS        (23)                            /* !< CNT7STOP Offset */
#define BTIMER_CPU_INT_IMASK_CNT7STOP_MASK       ((uint32_t)0x00800000U)         /* !< CNT7STOP Interrupt enable bit */
#define BTIMER_CPU_INT_IMASK_CNT7STOP_CLR        ((uint32_t)0x00000000U)         /* !< Interrupt is not pending. */
#define BTIMER_CPU_INT_IMASK_CNT7STOP_SET        ((uint32_t)0x00800000U)         /* !< Interrupt is pending. */

/* BTIMER_CPU_INT_RIS Bits */
/* BTIMER_CPU_INT_RIS[CNT0OVF] Bits */
#define BTIMER_CPU_INT_RIS_CNT0OVF_OFS           (0)                             /* !< CNT0OVF Offset */
#define BTIMER_CPU_INT_RIS_CNT0OVF_MASK          ((uint32_t)0x00000001U)         /* !< Counter 0 Period match flag */
#define BTIMER_CPU_INT_RIS_CNT0OVF_CLR           ((uint32_t)0x00000000U)         /* !< Interrupt is not pending. */
#define BTIMER_CPU_INT_RIS_CNT0OVF_SET           ((uint32_t)0x00000001U)         /* !< Interrupt is pending. */
/* BTIMER_CPU_INT_RIS[CNT0STRT] Bits */
#define BTIMER_CPU_INT_RIS_CNT0STRT_OFS          (1)                             /* !< CNT0STRT Offset */
#define BTIMER_CPU_INT_RIS_CNT0STRT_MASK         ((uint32_t)0x00000002U)         /* !< Counter 0 start event flag */
#define BTIMER_CPU_INT_RIS_CNT0STRT_CLR          ((uint32_t)0x00000000U)         /* !< Interrupt is not pending. */
#define BTIMER_CPU_INT_RIS_CNT0STRT_SET          ((uint32_t)0x00000002U)         /* !< Interrupt is pending. */
/* BTIMER_CPU_INT_RIS[CNT0STOP] Bits */
#define BTIMER_CPU_INT_RIS_CNT0STOP_OFS          (2)                             /* !< CNT0STOP Offset */
#define BTIMER_CPU_INT_RIS_CNT0STOP_MASK         ((uint32_t)0x00000004U)         /* !< Counter 0 stop event flag */
#define BTIMER_CPU_INT_RIS_CNT0STOP_CLR          ((uint32_t)0x00000000U)         /* !< Interrupt is not pending. */
#define BTIMER_CPU_INT_RIS_CNT0STOP_SET          ((uint32_t)0x00000004U)         /* !< Interrupt is pending. */
/* BTIMER_CPU_INT_RIS[CNT1OVF] Bits */
#define BTIMER_CPU_INT_RIS_CNT1OVF_OFS           (3)                             /* !< CNT1OVF Offset */
#define BTIMER_CPU_INT_RIS_CNT1OVF_MASK          ((uint32_t)0x00000008U)         /* !< Counter 1 Period match flag */
#define BTIMER_CPU_INT_RIS_CNT1OVF_CLR           ((uint32_t)0x00000000U)         /* !< Interrupt is not pending. */
#define BTIMER_CPU_INT_RIS_CNT1OVF_SET           ((uint32_t)0x00000008U)         /* !< Interrupt is pending. */
/* BTIMER_CPU_INT_RIS[CNT1STRT] Bits */
#define BTIMER_CPU_INT_RIS_CNT1STRT_OFS          (4)                             /* !< CNT1STRT Offset */
#define BTIMER_CPU_INT_RIS_CNT1STRT_MASK         ((uint32_t)0x00000010U)         /* !< Counter 1 start event flag */
#define BTIMER_CPU_INT_RIS_CNT1STRT_CLR          ((uint32_t)0x00000000U)         /* !< Interrupt is not pending. */
#define BTIMER_CPU_INT_RIS_CNT1STRT_SET          ((uint32_t)0x00000010U)         /* !< Interrupt is pending. */
/* BTIMER_CPU_INT_RIS[CNT1STOP] Bits */
#define BTIMER_CPU_INT_RIS_CNT1STOP_OFS          (5)                             /* !< CNT1STOP Offset */
#define BTIMER_CPU_INT_RIS_CNT1STOP_MASK         ((uint32_t)0x00000020U)         /* !< Counter 1 stop event flag */
#define BTIMER_CPU_INT_RIS_CNT1STOP_CLR          ((uint32_t)0x00000000U)         /* !< Interrupt is not pending. */
#define BTIMER_CPU_INT_RIS_CNT1STOP_SET          ((uint32_t)0x00000020U)         /* !< Interrupt is pending. */
/* BTIMER_CPU_INT_RIS[CNT2OVF] Bits */
#define BTIMER_CPU_INT_RIS_CNT2OVF_OFS           (6)                             /* !< CNT2OVF Offset */
#define BTIMER_CPU_INT_RIS_CNT2OVF_MASK          ((uint32_t)0x00000040U)         /* !< Counter 2 Period match flag */
#define BTIMER_CPU_INT_RIS_CNT2OVF_CLR           ((uint32_t)0x00000000U)         /* !< Interrupt is not pending. */
#define BTIMER_CPU_INT_RIS_CNT2OVF_SET           ((uint32_t)0x00000040U)         /* !< Interrupt is pending. */
/* BTIMER_CPU_INT_RIS[CNT2STRT] Bits */
#define BTIMER_CPU_INT_RIS_CNT2STRT_OFS          (7)                             /* !< CNT2STRT Offset */
#define BTIMER_CPU_INT_RIS_CNT2STRT_MASK         ((uint32_t)0x00000080U)         /* !< Counter 2 start event flag */
#define BTIMER_CPU_INT_RIS_CNT2STRT_CLR          ((uint32_t)0x00000000U)         /* !< Interrupt is not pending. */
#define BTIMER_CPU_INT_RIS_CNT2STRT_SET          ((uint32_t)0x00000080U)         /* !< Interrupt is pending. */
/* BTIMER_CPU_INT_RIS[CNT2STOP] Bits */
#define BTIMER_CPU_INT_RIS_CNT2STOP_OFS          (8)                             /* !< CNT2STOP Offset */
#define BTIMER_CPU_INT_RIS_CNT2STOP_MASK         ((uint32_t)0x00000100U)         /* !< Counter 2 stop event flag */
#define BTIMER_CPU_INT_RIS_CNT2STOP_CLR          ((uint32_t)0x00000000U)         /* !< Interrupt is not pending. */
#define BTIMER_CPU_INT_RIS_CNT2STOP_SET          ((uint32_t)0x00000100U)         /* !< Interrupt is pending. */
/* BTIMER_CPU_INT_RIS[CNT3OVF] Bits */
#define BTIMER_CPU_INT_RIS_CNT3OVF_OFS           (9)                             /* !< CNT3OVF Offset */
#define BTIMER_CPU_INT_RIS_CNT3OVF_MASK          ((uint32_t)0x00000200U)         /* !< Counter 3 Period match flag */
#define BTIMER_CPU_INT_RIS_CNT3OVF_CLR           ((uint32_t)0x00000000U)         /* !< Interrupt is not pending. */
#define BTIMER_CPU_INT_RIS_CNT3OVF_SET           ((uint32_t)0x00000200U)         /* !< Interrupt is pending. */
/* BTIMER_CPU_INT_RIS[CNT3STRT] Bits */
#define BTIMER_CPU_INT_RIS_CNT3STRT_OFS          (10)                            /* !< CNT3STRT Offset */
#define BTIMER_CPU_INT_RIS_CNT3STRT_MASK         ((uint32_t)0x00000400U)         /* !< Counter 3 start event flag */
#define BTIMER_CPU_INT_RIS_CNT3STRT_CLR          ((uint32_t)0x00000000U)         /* !< Interrupt is not pending. */
#define BTIMER_CPU_INT_RIS_CNT3STRT_SET          ((uint32_t)0x00000400U)         /* !< Interrupt is pending. */
/* BTIMER_CPU_INT_RIS[CNT3STOP] Bits */
#define BTIMER_CPU_INT_RIS_CNT3STOP_OFS          (11)                            /* !< CNT3STOP Offset */
#define BTIMER_CPU_INT_RIS_CNT3STOP_MASK         ((uint32_t)0x00000800U)         /* !< Counter 3 stop event flag */
#define BTIMER_CPU_INT_RIS_CNT3STOP_CLR          ((uint32_t)0x00000000U)         /* !< Interrupt is not pending. */
#define BTIMER_CPU_INT_RIS_CNT3STOP_SET          ((uint32_t)0x00000800U)         /* !< Interrupt is pending. */
/* BTIMER_CPU_INT_RIS[CNT4OVF] Bits */
#define BTIMER_CPU_INT_RIS_CNT4OVF_OFS           (12)                            /* !< CNT4OVF Offset */
#define BTIMER_CPU_INT_RIS_CNT4OVF_MASK          ((uint32_t)0x00001000U)         /* !< Counter 4 Period match flag */
#define BTIMER_CPU_INT_RIS_CNT4OVF_CLR           ((uint32_t)0x00000000U)         /* !< Interrupt is not pending. */
#define BTIMER_CPU_INT_RIS_CNT4OVF_SET           ((uint32_t)0x00001000U)         /* !< Interrupt is pending. */
/* BTIMER_CPU_INT_RIS[CNT4STRT] Bits */
#define BTIMER_CPU_INT_RIS_CNT4STRT_OFS          (13)                            /* !< CNT4STRT Offset */
#define BTIMER_CPU_INT_RIS_CNT4STRT_MASK         ((uint32_t)0x00002000U)         /* !< Counter 4 start event flag */
#define BTIMER_CPU_INT_RIS_CNT4STRT_CLR          ((uint32_t)0x00000000U)         /* !< Interrupt is not pending. */
#define BTIMER_CPU_INT_RIS_CNT4STRT_SET          ((uint32_t)0x00002000U)         /* !< Interrupt is pending. */
/* BTIMER_CPU_INT_RIS[CNT4STOP] Bits */
#define BTIMER_CPU_INT_RIS_CNT4STOP_OFS          (14)                            /* !< CNT4STOP Offset */
#define BTIMER_CPU_INT_RIS_CNT4STOP_MASK         ((uint32_t)0x00004000U)         /* !< Counter 4 stop event flag */
#define BTIMER_CPU_INT_RIS_CNT4STOP_CLR          ((uint32_t)0x00000000U)         /* !< Interrupt is not pending. */
#define BTIMER_CPU_INT_RIS_CNT4STOP_SET          ((uint32_t)0x00004000U)         /* !< Interrupt is pending. */
/* BTIMER_CPU_INT_RIS[CNT5OVF] Bits */
#define BTIMER_CPU_INT_RIS_CNT5OVF_OFS           (15)                            /* !< CNT5OVF Offset */
#define BTIMER_CPU_INT_RIS_CNT5OVF_MASK          ((uint32_t)0x00008000U)         /* !< Counter 5 Period match flag */
#define BTIMER_CPU_INT_RIS_CNT5OVF_CLR           ((uint32_t)0x00000000U)         /* !< Interrupt is not pending. */
#define BTIMER_CPU_INT_RIS_CNT5OVF_SET           ((uint32_t)0x00008000U)         /* !< Interrupt is pending. */
/* BTIMER_CPU_INT_RIS[CNT5STRT] Bits */
#define BTIMER_CPU_INT_RIS_CNT5STRT_OFS          (16)                            /* !< CNT5STRT Offset */
#define BTIMER_CPU_INT_RIS_CNT5STRT_MASK         ((uint32_t)0x00010000U)         /* !< Counter 5 start event flag */
#define BTIMER_CPU_INT_RIS_CNT5STRT_CLR          ((uint32_t)0x00000000U)         /* !< Interrupt is not pending. */
#define BTIMER_CPU_INT_RIS_CNT5STRT_SET          ((uint32_t)0x00010000U)         /* !< Interrupt is pending. */
/* BTIMER_CPU_INT_RIS[CNT5STOP] Bits */
#define BTIMER_CPU_INT_RIS_CNT5STOP_OFS          (17)                            /* !< CNT5STOP Offset */
#define BTIMER_CPU_INT_RIS_CNT5STOP_MASK         ((uint32_t)0x00020000U)         /* !< Counter 5 stop event flag */
#define BTIMER_CPU_INT_RIS_CNT5STOP_CLR          ((uint32_t)0x00000000U)         /* !< Interrupt is not pending. */
#define BTIMER_CPU_INT_RIS_CNT5STOP_SET          ((uint32_t)0x00020000U)         /* !< Interrupt is pending. */
/* BTIMER_CPU_INT_RIS[CNT6OVF] Bits */
#define BTIMER_CPU_INT_RIS_CNT6OVF_OFS           (18)                            /* !< CNT6OVF Offset */
#define BTIMER_CPU_INT_RIS_CNT6OVF_MASK          ((uint32_t)0x00040000U)         /* !< Counter 6 Period match flag */
#define BTIMER_CPU_INT_RIS_CNT6OVF_CLR           ((uint32_t)0x00000000U)         /* !< Interrupt is not pending. */
#define BTIMER_CPU_INT_RIS_CNT6OVF_SET           ((uint32_t)0x00040000U)         /* !< Interrupt is pending. */
/* BTIMER_CPU_INT_RIS[CNT6STRT] Bits */
#define BTIMER_CPU_INT_RIS_CNT6STRT_OFS          (19)                            /* !< CNT6STRT Offset */
#define BTIMER_CPU_INT_RIS_CNT6STRT_MASK         ((uint32_t)0x00080000U)         /* !< Counter 6 start event flag */
#define BTIMER_CPU_INT_RIS_CNT6STRT_CLR          ((uint32_t)0x00000000U)         /* !< Interrupt is not pending. */
#define BTIMER_CPU_INT_RIS_CNT6STRT_SET          ((uint32_t)0x00080000U)         /* !< Interrupt is pending. */
/* BTIMER_CPU_INT_RIS[CNT6STOP] Bits */
#define BTIMER_CPU_INT_RIS_CNT6STOP_OFS          (20)                            /* !< CNT6STOP Offset */
#define BTIMER_CPU_INT_RIS_CNT6STOP_MASK         ((uint32_t)0x00100000U)         /* !< Counter 6 stop event flag */
#define BTIMER_CPU_INT_RIS_CNT6STOP_CLR          ((uint32_t)0x00000000U)         /* !< Interrupt is not pending. */
#define BTIMER_CPU_INT_RIS_CNT6STOP_SET          ((uint32_t)0x00100000U)         /* !< Interrupt is pending. */
/* BTIMER_CPU_INT_RIS[CNT7OVF] Bits */
#define BTIMER_CPU_INT_RIS_CNT7OVF_OFS           (21)                            /* !< CNT7OVF Offset */
#define BTIMER_CPU_INT_RIS_CNT7OVF_MASK          ((uint32_t)0x00200000U)         /* !< Counter 7 Period match flag */
#define BTIMER_CPU_INT_RIS_CNT7OVF_CLR           ((uint32_t)0x00000000U)         /* !< Interrupt is not pending. */
#define BTIMER_CPU_INT_RIS_CNT7OVF_SET           ((uint32_t)0x00200000U)         /* !< Interrupt is pending. */
/* BTIMER_CPU_INT_RIS[CNT7STRT] Bits */
#define BTIMER_CPU_INT_RIS_CNT7STRT_OFS          (22)                            /* !< CNT7STRT Offset */
#define BTIMER_CPU_INT_RIS_CNT7STRT_MASK         ((uint32_t)0x00400000U)         /* !< Counter 7 start event flag */
#define BTIMER_CPU_INT_RIS_CNT7STRT_CLR          ((uint32_t)0x00000000U)         /* !< Interrupt is not pending. */
#define BTIMER_CPU_INT_RIS_CNT7STRT_SET          ((uint32_t)0x00400000U)         /* !< Interrupt is pending. */
/* BTIMER_CPU_INT_RIS[CNT7STOP] Bits */
#define BTIMER_CPU_INT_RIS_CNT7STOP_OFS          (23)                            /* !< CNT7STOP Offset */
#define BTIMER_CPU_INT_RIS_CNT7STOP_MASK         ((uint32_t)0x00800000U)         /* !< Counter 7 stop event flag */
#define BTIMER_CPU_INT_RIS_CNT7STOP_CLR          ((uint32_t)0x00000000U)         /* !< Interrupt is not pending. */
#define BTIMER_CPU_INT_RIS_CNT7STOP_SET          ((uint32_t)0x00800000U)         /* !< Interrupt is pending. */

